OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j11.h
extern __at(0x0FAE) __sfr TXREG;
extern __at(0x0FAE) __sfr TXREG1;
extern __at(0x0FAF) __sfr RCREG;
extern __at(0x0FAF) __sfr RCREG1;
extern __at(0x0FB0) __sfr SPBRG;
extern __at(0x0FB0) __sfr SPBRG1;

//==============================================================================
//        CCP3CON Bits

extern __at(0x0FB1) __sfr CCP3CON;

typedef union
  {
  struct
    {
    unsigned CCP3M0             : 1;
    unsigned CCP3M1             : 1;
    unsigned CCP3M2             : 1;
    unsigned CCP3M3             : 1;
    unsigned DC3B0              : 1;
    unsigned DC3B1              : 1;
    unsigned P3M0               : 1;
    unsigned P3M1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP3Y              : 1;
    unsigned CCP3X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP3M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC3B               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned P3M                : 2;
    };
  } __CCP3CONbits_t;

extern __at(0x0FB1) volatile __CCP3CONbits_t CCP3CONbits;

#define _CCP3M0                 0x01
#define _CCP3M1                 0x02
#define _CCP3M2                 0x04
#define _CCP3M3                 0x08
#define _DC3B0                  0x10
#define _CCP3Y                  0x10
#define _DC3B1                  0x20
#define _CCP3X                  0x20
#define _P3M0                   0x40
#define _P3M1                   0x80

//==============================================================================


//==============================================================================
//        ECCP3CON Bits

extern __at(0x0FB1) __sfr ECCP3CON;

typedef union
  {
  struct
    {
    unsigned CCP3M0             : 1;
    unsigned CCP3M1             : 1;
    unsigned CCP3M2             : 1;
    unsigned CCP3M3             : 1;
    unsigned DC3B0              : 1;
    unsigned DC3B1              : 1;
    unsigned P3M0               : 1;
    unsigned P3M1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP3Y              : 1;
    unsigned CCP3X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP3M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC3B               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned P3M                : 2;
    };
  } __ECCP3CONbits_t;

extern __at(0x0FB1) volatile __ECCP3CONbits_t ECCP3CONbits;

#define _ECCP3CON_CCP3M0        0x01
#define _ECCP3CON_CCP3M1        0x02
#define _ECCP3CON_CCP3M2        0x04
#define _ECCP3CON_CCP3M3        0x08
#define _ECCP3CON_DC3B0         0x10
#define _ECCP3CON_CCP3Y         0x10
#define _ECCP3CON_DC3B1         0x20
#define _ECCP3CON_CCP3X         0x20
#define _ECCP3CON_P3M0          0x40
#define _ECCP3CON_P3M1          0x80

//==============================================================================

extern __at(0x0FB2) __sfr CCPR3;
extern __at(0x0FB2) __sfr CCPR3L;
extern __at(0x0FB3) __sfr CCPR3H;

//==============================================================================
//        ECCP3DEL Bits

extern __at(0x0FB4) __sfr ECCP3DEL;

typedef union
  {
  struct
    {
    unsigned PDC0               : 1;
    unsigned PDC1               : 1;
    unsigned PDC2               : 1;
    unsigned PDC3               : 1;
    unsigned PDC4               : 1;
    unsigned PDC5               : 1;
    unsigned PDC6               : 1;
    unsigned PRSEN              : 1;
    };

  struct
    {
    unsigned P3DC0              : 1;
    unsigned P3DC1              : 1;
    unsigned P3DC2              : 1;
    unsigned P3DC3              : 1;
    unsigned P3DC4              : 1;
    unsigned P3DC5              : 1;
    unsigned P3DC6              : 1;
    unsigned P3RSEN             : 1;
    };

  struct
    {
    unsigned PDC                : 7;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3DC               : 7;
    unsigned                    : 1;
    };
  } __ECCP3DELbits_t;

extern __at(0x0FB4) volatile __ECCP3DELbits_t ECCP3DELbits;

#define _ECCP3DEL_PDC0          0x01
#define _ECCP3DEL_P3DC0         0x01
#define _ECCP3DEL_PDC1          0x02
#define _ECCP3DEL_P3DC1         0x02
#define _ECCP3DEL_PDC2          0x04
#define _ECCP3DEL_P3DC2         0x04
#define _ECCP3DEL_PDC3          0x08
#define _ECCP3DEL_P3DC3         0x08
#define _ECCP3DEL_PDC4          0x10
#define _ECCP3DEL_P3DC4         0x10
#define _ECCP3DEL_PDC5          0x20
#define _ECCP3DEL_P3DC5         0x20
#define _ECCP3DEL_PDC6          0x40
#define _ECCP3DEL_P3DC6         0x40
#define _ECCP3DEL_PRSEN         0x80
#define _ECCP3DEL_P3RSEN        0x80

//==============================================================================


//==============================================================================
//        ECCP3AS Bits

extern __at(0x0FB5) __sfr ECCP3AS;

typedef union
  {
  struct
    {
    unsigned PSSBD0             : 1;
    unsigned PSSBD1             : 1;
    unsigned PSSAC0             : 1;
    unsigned PSSAC1             : 1;
    unsigned ECCPAS0            : 1;
    unsigned ECCPAS1            : 1;
    unsigned ECCPAS2            : 1;
    unsigned ECCPASE            : 1;
    };

  struct
    {
    unsigned PSS3BD0            : 1;
    unsigned PSS3BD1            : 1;
    unsigned PSS3AC0            : 1;
    unsigned PSS3AC1            : 1;
    unsigned ECCP3AS0           : 1;
    unsigned ECCP3AS1           : 1;
    unsigned ECCP3AS2           : 1;
    unsigned ECCP3ASE           : 1;
    };

  struct
    {
    unsigned PSS3BD             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PSSBD              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSSAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS3AC             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP3AS            : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCPAS             : 3;
    unsigned                    : 1;
    };
  } __ECCP3ASbits_t;

extern __at(0x0FB5) volatile __ECCP3ASbits_t ECCP3ASbits;

#define _ECCP3AS_PSSBD0         0x01
#define _ECCP3AS_PSS3BD0        0x01
#define _ECCP3AS_PSSBD1         0x02
#define _ECCP3AS_PSS3BD1        0x02
#define _ECCP3AS_PSSAC0         0x04
#define _ECCP3AS_PSS3AC0        0x04
#define _ECCP3AS_PSSAC1         0x08
#define _ECCP3AS_PSS3AC1        0x08
#define _ECCP3AS_ECCPAS0        0x10
#define _ECCP3AS_ECCP3AS0       0x10
#define _ECCP3AS_ECCPAS1        0x20
#define _ECCP3AS_ECCP3AS1       0x20
#define _ECCP3AS_ECCPAS2        0x40
#define _ECCP3AS_ECCP3AS2       0x40
#define _ECCP3AS_ECCPASE        0x80
#define _ECCP3AS_ECCP3ASE       0x80

//==============================================================================


//==============================================================================
//        CCP2CON Bits

extern __at(0x0FB6) __sfr CCP2CON;

typedef union
  {
  struct
    {
    unsigned CCP2M0             : 1;
    unsigned CCP2M1             : 1;
    unsigned CCP2M2             : 1;
    unsigned CCP2M3             : 1;
    unsigned DC2B0              : 1;
    unsigned DC2B1              : 1;
    unsigned P2M0               : 1;
    unsigned P2M1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP2Y              : 1;
    unsigned CCP2X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP2M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC2B               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned P2M                : 2;
    };
  } __CCP2CONbits_t;

